bscopix/Ble_Mesh_Kp/STM32_WPAN/App/appli_mesh.c
/********************* Application configuration **************************/
#if defined(__GNUC__) || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM)
MOBLEUINT8 bdaddr[8];

#ifdef INTERNAL_UNIQUE_NUMBER_MAC
static void Appli_GetMACfromUniqueNumber(void);
#endif /* INTERNAL_UNIQUE_NUMBER_MAC */

const void *mobleNvmBase; 
const void *appNvmBase;
const void *modeNvmBase;
const void *runtimeNvmBase;
const void *prvsnr_data;
#else
#error "Unknown compiler"
#endif /* __GNUC__ || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM) */

#if ENABLE_SERIAL_INTERFACE
extern uint8_t button_emulation;
#endif

/* Private function prototypes -----------------------------------------------*/
static void Appli_LongButtonPress(void);
static void Appli_ShortButtonPress(void);
#if USER_OUTPUT_OOB_APPLI_PROCESS
void Appli_OobAuthenticationProcess(void);
#endif
#ifdef ENABLE_AUTH_TYPE_INPUT_OOB
static void InputOOBTimeOutTask(void);
#endif
void BLEMesh_UnprovisionCallback(MOBLEUINT8 reason);
void Appli_LowPowerProcess(void);
#if (APPLI_OPTIM == 1)
static void AppliMeshTask(void);
#endif
void Appli_GetPublicationParamsCb(model_publicationparams_t* pPubParameters);
WEAK_FUNCTION (void SerialPrvn_ProvisioningStatusUpdateCb(uint8_t flagPrvningInProcess,
                                                          MOBLEUINT16 nodeAddress));

/* Private functions ---------------------------------------------------------*/

/************************* Button Control functions ********************/
/**
* @brief  Function calls when a button is pressed for short duration  
* @param  void
* @retval void
*/ 
static void Appli_ShortButtonPress(void)
{
  BLEMesh_ModelsCommand();
}
  

/**
* @brief  Function calls when a button is pressed for Long duration  
* @param  void
* @retval void
*/ 
static void Appli_LongButtonPress(void)
{
  /** GENERIC ONOFF **/  
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API ONOFF GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_ON_OFF_GET, NULL);  
  
  /** GENERIC LEVEL **/  
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API LEVEL GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_LEVEL_GET, NULL);  
  
  /** GENERIC POWER ONOFF **/  
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API POWER ON OFF GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_POWER_ON_OFF_GET, NULL);  
  
  /** GENERIC TRANSITION TIME **/ 
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API DEFAULT TRANSITION TIME GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_DEFAULT_TRANSITION_TIME_GET, NULL);  
  
  /** LIGHT LIGHTNESS **/   
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_GET, NULL);  
  
  /** LIGHT LIGHTNESS LINEAR **/ 
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS LINEAR GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_LINEAR_GET, NULL);  
  
  /** LIGHT LIGHTNESS DEFAULT **/ 
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS DEFAULT GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_DEFAULT_GET, NULL);  
  
  /** LIGHT LIGHTNESS RANGE **/ 
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS RANGE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_RANGE_GET, NULL); 
  
  /** LIGHT LIGHTNESS CTL **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_GET, NULL);  
  
  /** LIGHT LIGHTNESS CTL TEMPERATURE **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL TEMPERATURE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_TEMPERATURE_GET, NULL);  
  
  /** LIGHT LIGHTNESS CTL TEMPERATURE RANGE **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL TEMPERATURE RANGE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_TEMPERATURE_RANGE_GET, NULL);  
  
  /** LIGHT LIGHTNESS CTL DEFAULT **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL DEFAULT GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_DEFAULT_GET, NULL);  
  
  /** LIGHT LIGHTNESS HSL **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_GET, NULL);  

  /** LIGHT LIGHTNESS HSL DEFAULT **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL DEFAULT GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_DEFAULT_GET, NULL);  

  /** LIGHT LIGHTNESS HSL RANGE**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL RANGE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_RANGE_GET, NULL);  
  
  /** LIGHT LIGHTNESS HSL HUE**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL HUE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_HUE_GET, NULL);
  
  /** LIGHT LIGHTNESS HSL SATURATION**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL SATURATION GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_SATURATION_GET, NULL);

  /** LIGHT LC MODE**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LC MODE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LC_MODE_GET, NULL);
  
  /** LIGHT LC OM**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LC OM GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LC_OM_GET, NULL);
  
  /** LIGHT LC ON OFF**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LC ON OFF GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LC_ON_OFF_GET, NULL);
  
  /** LIGHT LC PROPERTY **/
//LIGHT_CONTROL_AMBIENT_LUXLEVEL_ON_PID  : 0x002B
  pPropertyId[0]= 0x2B;           // Property ID byte 0 : Property ID identifying a Light LC Property.
  pPropertyId[1]= 0x00;           // Property ID byte 1 : Property ID identifying a Light LC Property.
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LC PROPERTY GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LC_PROPERTY_GET, pPropertyId);
  

  /* SENSOR APIs */
  //PRESENT_AMBIENT_TEMPERATURE_PID : 0x004F
  pPropertyId[0]= 0x4F;           // Property ID byte 0 : Property ID for the sensor
  pPropertyId[1]= 0x00;           // Property ID byte 1 : Property ID for the sensor
  
  /** SENSOR DESCRIPTOR**/
//  TRACE_I(TF_SENSOR_CLIENT_M, "----------- API SENSOR DESCRIPTOR GET ------------- \r\n");
//  Appli_SensorsClient_API(0, SENSOR_DESCRIPTOR_GET, pPropertyId);
  
  /** SENSOR CADENCE**/
//  TRACE_I(TF_SENSOR_CLIENT_M, "----------- API SENSOR CADENCE GET ------------- \r\n");
//  Appli_SensorsClient_API(0, SENSOR_CADENCE_GET, pPropertyId);
  
    /** SENSOR SETTINGS **/
//  TRACE_I(TF_SENSOR_CLIENT_M, "----------- API SENSOR SETTINGS GET ------------- \r\n");
//  Appli_SensorsClient_API(0, SENSOR_SETTINGS_GET, pPropertyId);
  
    /** SENSOR SETTING **/
  pPropertyId[2]= 0xAD;           // Sensor Setting Property ID byte 0 : Property ID for the sensor setting
  pPropertyId[3]= 0x00;           // Sensor Setting Property ID byte 1 : Property ID for the sensor setting
 
//  TRACE_I(TF_SENSOR_CLIENT_M, "----------- API SENSOR SETTING GET ------------- \r\n");
//  Appli_SensorsClient_API(0, SENSOR_SETTING_GET, pPropertyId);
  
  /** SENSOR GET **/
//  TRACE_I(TF_SENSOR_CLIENT_M, "----------- API SENSOR GET ------------- \r\n");
//  Appli_SensorsClient_API(0, SENSOR_GET, pPropertyId);
  
  /** SENSOR COLUMN **/
//  pPropertyId[2]= 0x01;           // Raw Value X byte 0 : Raw value identifying a column
//  pPropertyId[3]= 0x00;           // Raw Value X byte 1 : Raw value identifying a column
//  TRACE_I(TF_SENSOR_CLIENT_M, "----------- API SENSOR COLUMN GET ------------- \r\n");
//  Appli_SensorsClient_API(0, SENSOR_COLUMN_GET, pPropertyId);
  
  /** SENSOR SERIES **/
//  pPropertyId[2]= 0x01;           // Raw Value X1 byte 0 : Raw value identifying a starting column.
//  pPropertyId[3]= 0x02;           // Raw Value X2 byte 0 : Raw value identifying an ending column.
//  TRACE_I(TF_SENSOR_CLIENT_M, "----------- API SENSOR SERIES GET ------------- \r\n");
//  Appli_SensorsClient_API(0, SENSOR_SERIES_GET, pPropertyId);
  
  IntensityPublish();
  
