bscopix/Ble_Mesh_Kp/STM32_WPAN/App/appli_mesh.c
}

/**
* @brief  Updates the button status  
* @param  int isPressed
* @retval void
*/ 
static void Appli_UpdateButtonState(int isPressed)
{
  uint32_t t0 = 0,t1 = 1;

  t0 = Clock_Time(); /* SW1 press timing */
  
  while(BSP_PB_GetState(BUTTON_SW1) == BUTTON_PRESSED);
  t1 = Clock_Time(); /* SW1 release timing */
  
  if((t1 - t0) > LONG_PRESS_THRESHOLD)
  {
    Appli_LongButtonPress();
  }
  else if((t1 - t0) > BOUNCE_THRESHOLD)
  {
    /* Button 1 short press action */
    Appli_ShortButtonPress();
  }
}

/**
* @brief  task for the BLE MESH, the MESH Models and the Appli processes  
* @param  void
* @retval void
*/ 
static void Mesh_Task()
{
  BLEMesh_Process();
  BLEMesh_ModelsProcess(); /* Models Processing */

  /* With APPLI_OPTIM=0 the Mesh task schedules itself forever, so the outer
   * UTIL_SEQ_Run() never returns. Reaching this point proves that both Mesh
   * processing stages completed; a blocked callback still prevents refresh. */
  APPE_WatchdogHeartbeat();
  
  if((UnprovisionInProgress > 0) &&
     (!LL_FLASH_IsActiveFlag_OperationSuspended()))
  {
    UnprovisionInProgress = 0;
    AppliNvm_ClearModelState();
    Appli_EraseProvisioningStorage();
    ClearProvisioningBootRequest(PROVISION_RESULT_UNKNOWN);
    TRACE_I(TF_PROVISION,"Device is unprovisioned by application \r\n");      
  }
    
#if (APPLI_OPTIM == 0)
  /* Set the task in the scheduler for the next execution */
#if (LOW_POWER_FEATURE == 0)
  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);
#endif
#endif
}

/**
* @brief  task for the BLE MESH, the MESH Models and the Appli processes  
* @param  void
* @retval void
*/ 
static void Appli_Task()
{
  if ((ProvisioningSessionCommitPending != 0U) ||
      (MeshConfigCommitPending != 0U))
  {
    MOBLE_RESULT nvm_result = PalNvmProcess();

    /* Never reset before the Mesh library has committed its serialized
     * network image. PalNvmProcess deliberately defers while PB-GATT/Proxy is
     * connected, hence this task is armed by the disconnect callback. */
    if ((nvm_result != MOBLE_RESULT_SUCCESS) || (nvm_operation != 0U))
    {
      TRACE_I(TF_PROVISION,"Mesh commit waiting for NVM op=%u result=%d\r\n",
              (unsigned int)nvm_operation,
              nvm_result);
      UTIL_SEQ_SetTask(1UL << CFG_TASK_APPLI_REQ_ID, CFG_SCH_PRIO_0);
      return;
    }

    if (IsProvisioningRuntimeSessionActive())
    {
      ProvisioningSessionCommitPending = 0U;
      MeshConfigCommitPending = 0U;
      StopProvisioningRuntimeSession(PROVISION_RESULT_SUCCESS);

      /* Provisioning is complete before configuration starts. Persist the
       * operational target outside the Mesh NVM, then reboot so the Proxy
       * service starts from a clean CPU1/CPU2 state. */
      if (ModeManager_RequestMode(BOOT_MODE_MESH_OPERATIONAL, 0U))
      {
        TRACE_I(TF_PROVISION,"Provisioning committed: reboot to Mesh operational\r\n");
        HAL_Delay(250U);
        NVIC_SystemReset();
      }
      else
      {
        TRACE_I(TF_PROVISION,"Provisioning committed but mode NVM write failed; keep runtime alive\r\n");
      }
    }
    else if (MeshConfigCommitPending != 0U)
    {
      /* Config Server traffic and the following flash rotation coincide with
       * the ST library rearming Proxy advertising.  Some controller/library
       * states keep transmitting an empty, non-connectable advertisement.
       * Once the verified NVM transaction is complete, reboot CPU1/CPU2 so
       * the Proxy service is rebuilt from a clean persisted configuration. */
      MeshConfigCommitPending = 0U;
      ProvisioningSessionCommitPending = 0U;
      ConfigServerDirty = 0U;
      TRACE_I(TF_PROVISION,"Mesh configuration committed: controlled Proxy restart\r\n");
      ModeManager_ScheduleReset();
      return;
    }
  }

  Appli_Process();
  
#if (APPLI_OPTIM == 0)
  /* Set the task in the scheduler for the next execution */
#if (LOW_POWER_FEATURE == 0)
  UTIL_SEQ_SetTask( 1<<CFG_TASK_APPLI_REQ_ID, CFG_SCH_PRIO_0);
#endif
#endif
}

/************************* LED Control functions ********************/
/**
* @brief  Controls the state of on board LED
* @param  void
* @retval void
*/ 
void Appli_LedCtrl(void)
{
  if(Appli_LedState)
  {
    BSP_LED_On(LED_BLUE);

  }
  else
  {
    BSP_LED_Off(LED_BLUE);

  }
}

/************* BLE-Mesh library callback functions ***************/

/**
* @brief  Blinks the on board LED  
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_LedBlink(void)
{
  /* Switch On the LED */
  Appli_LedState = 1;
  Appli_LedCtrl();
  Clock_Wait(500);
  
  /* Switch Off the LED */
  Appli_LedState = 0;
  Appli_LedCtrl();
  Clock_Wait(500);
  
  return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  Callback function Sets the state of the bulb 
* @param  MOBLEUINT16 ctrl which sets the lighting state of LED
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_LedStateCtrlCb(MOBLEUINT16 ctrl)
{
  /* Switch On the LED */
  if(ctrl > 0)
  {
    Appli_LedState = 1;
  }
  /* Switch Off the LED */
  else
  {
    Appli_LedState = 0;
  }
  
  Appli_LedCtrl();
  
  return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  initializes BLE Stack    
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleStackInitCb()
{
  /* BLE Stack initialization */
  /* Not Required in BLE */
  return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  Sets transmission power of RF 
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleSetTxPowerCb(void)
{
  tBleStatus status;
  /* API to change the Transmission power of BLE Device */
  /* uint8_t en_high_power, uint8_t pa_level
  en_high_power Can be only 0 or 1. Set high power bit on or off.
  pa_level Can be from 0 to 7. Set the PA level value
  */ 
  status = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
  if (status)
    return MOBLE_RESULT_FAIL;
  else
    return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  SET UUID value 
* @param  uuid_prefix_data : Pointer of UUID buffer data
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleSetUUIDCb(MOBLEUINT8 *uuid_prefix_data)
{
  /* UUID is 128 bits (16 bytes) and can guarantee uniqueness across space and time.
     It can be "Time-based" UUID or "truly-random or pseudo-random numbers"
 
     In this buffer user need to fill 10 bytes of UUID data. 
     Remaining 6 bytes, library fill this data with BDaddress.

    For example :
        F81D4FAE-7DEC-XBC4-Y12F-17D1AD07A961 (16 bytes)
        <any number> |_|  |_|   <BDAddress>

