bscopix/Ble_Mesh_Kp/STM32_WPAN/App/appli_mesh.c
      X = 1 i.e. "Time Base UUID"
      X = 4 i.e. "Random Number"
      Y = 4 i.e. Conforming to the current spec 
    For UUID information refer RFC4122
  */
  
  /* copy UUID prefix data*/
  uint8_t uuid_buff[10] = {0xF8,0x1D,0x4F,0xAE,0x7D,0xEC};/*random value by user */

   uuid_buff[6] = 0x4B;  /* 0x4B => 4 : Random */
   uuid_buff[7] = 'S' ;  /* User define value */
   uuid_buff[8] = 0xA1;  /* 0xA1 => A : Conforming to the current Spec */
   uuid_buff[9] = 'T' ;  /* User define value */  

   memcpy(uuid_prefix_data,uuid_buff,sizeof(uuid_buff));
   memcpy(&uuid_prefix_data[10],bdaddr,6);  /* Copy bdaddr to last 6 bytes of UUID */
   
   return MOBLE_RESULT_SUCCESS;
}


/**
* @brief  SET CID , PID and VID values 
* @param  company_product_info : vendor fill product information in this buffer
* @retval MOBLE_RESULT status of result
*/
MOBLE_RESULT Appli_BleSetProductInfoCB(MOBLEUINT8 *company_product_info)
{
  /* CID : provide 16-bit company identifier assigned by the Bluetooth SIG */
  uint16_t company_id                   = COMPANY_ID;
  
  /* PID : Provide 16-bit vendor-assigned product identifier */
  uint16_t product_id                   = PRODUCT_ID;
  
  /* VID : Provide 16-bit vendor-assigned product version identifier*/
  uint16_t product_version_id           = PRODUCT_VERSION_ID;
  
  memcpy(company_product_info + 0,(void *)&company_id,sizeof(company_id));
  memcpy(company_product_info + 2 ,(void *)&product_id,sizeof(product_id));
  memcpy(company_product_info + 4 ,(void *)&product_version_id,sizeof(product_version_id));
  
  return MOBLE_RESULT_SUCCESS;
}


/**
* @brief  Call back function called when GATT Connection Created  
* @param  none
* @retval none
*/ 
void Appli_BleGattConnectionCompleteCb(void)
{ 
  ProvisionFlag = 1;
  ProvisioningTimeoutNotified = 0U;
  /* Proxy Node, will be called whenever Gatt connection is established */
  /* Turn ON Red LED*/
  ProxyFlag = 1;
  BSP_LED_On(LED_GREEN);
}

/**
* @brief  Call back function called when GATT Disconnection Complete  
* @param  none
* @retval none
*/ 
void Appli_BleGattDisconnectionCompleteCb(void)
{ 
  ProvisionFlag = 0;
  /* Proxy Node, will be called whenever Gatt disconnected */
  /* Turn Off Red LED*/
  ProxyFlag = 0;
  BSP_LED_Off(LED_GREEN);

  /* PB-GATT provisioning is complete as soon as the mesh library reports the
   * node provisioned.  Configuration traffic (AppKey/bind/subscription) is a
   * later optional phase and must not keep the persisted boot result UNKNOWN. */
  if (IsProvisioningRuntimeSessionActive() &&
      (BLEMesh_IsUnprovisioned() == MOBLE_FALSE))
  {
    if (ProvisioningSessionCommitPending == 0U)
    {
      ProvisioningSessionCommitPending = 1U;
      TRACE_I(TF_PROVISION,"Provisioning session completed (disconnect, config_seen=%u)\r\n",
              ConfigServerDirty);
    }
    UTIL_SEQ_SetTask(1UL << CFG_TASK_APPLI_REQ_ID, CFG_SCH_PRIO_0);
  }
  else if ((BLEMesh_IsUnprovisioned() == MOBLE_FALSE) &&
           (ConfigServerDirty != 0U))
  {
    /* Only a successful mutating Config Server callback proves that this
     * Proxy session changed persistent configuration.  SEQ, RPL, reads and
     * vendor model state use the same library NVM bits and stay on the
     * batched runtime journal path without restarting the node. */
    MeshConfigCommitPending = 1U;
    TRACE_I(TF_PROVISION,
            "Mesh configuration disconnect: commit op=%u then restart Proxy\r\n",
            (unsigned int)nvm_operation);
    UTIL_SEQ_SetTask(1UL << CFG_TASK_APPLI_REQ_ID, CFG_SCH_PRIO_0);
  }
}

MOBLEBOOL AppliMesh_IsNvmCommitUrgent(void)
{
  return ((ProvisioningSessionCommitPending != 0U) ||
          (MeshConfigCommitPending != 0U) ||
          (ConfigServerDirty != 0U))
             ? MOBLE_TRUE
             : MOBLE_FALSE;
}

/**
* @brief Unprovisioned Node Identification
* @param MOBLEUINT8 data 
* @retval none
*/
void Appli_BleUnprovisionedIdentifyCb(MOBLEUINT8 data)
{
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  PrvngInProcess = 1;  
#endif   
  TRACE_I(TF_PROVISION,"Unprovisioned Node Identifier received: %02x\n\r", data);
}

/**
* @brief  Set Number of Elements in a Node
* @param  none
* @retval Sending the value to BLE Mesh Library
*/ 
MOBLEUINT8 Appli_BleSetNumberOfElementsCb(void)
{
  if(NumberOfElements > BLEMesh_GetNumberOfElements())
  {
    TRACE_I(TF_MISC, "Number of Elements enabled in application exceeding from Library Capability!\r\n"); 
    return BLEMesh_GetNumberOfElements();
  }
  
  else if(NumberOfElements == 0)
  {
    TRACE_I(TF_MISC,"Number Of Elements must be 1 or greater than 1!\r\n"); 
    return 1;
  }
  
  else
  {
    return NumberOfElements;
  }
}

/**
* @brief  Sets the Attention Timer Callback function
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleAttentionTimerCb(void)
{
/* Provide a visible identify feedback when provisioner triggers attention. */
#if (LOW_POWER_FEATURE == 0)
  BSP_LED_Toggle(LED_BLUE);
#endif /* LOW_POWER_FEATURE == 0 */
  return MOBLE_RESULT_SUCCESS;
}


/**
* @brief  Call back function to give Output OOB information 
* @param  MOBLEUINT8* output_oob
* @param  MOBLEUINT8 size
* @retval void
*/ 
void Appli_BleOutputOOBAuthCb(MOBLEUINT8* output_oob, MOBLEUINT8 size)
{
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  uint32_t ooBData = 0;    
    for (MOBLEUINT8 i = 0; i < size; i++)
    {
        ooBData |= (output_oob[i] << 8*i);
    }
    OutputOobData = ooBData;
    TRACE_I(TF_PROVISION,"Output OOB information for provisioner: %lu\n\r", (unsigned long)ooBData);
  #endif
}
  

#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
/**
* @brief  Process for both output and Input OOB handling
* @param  void
* @retval void
*/ 
void Appli_OobAuthenticationProcess(void)
{
    if(OutputOobBlinkCount < OutputOobData)
    {
      OutputOobBlinkCount++;
      Appli_LedBlink();
    }
    else
    {
        OutputOobBlinkCount++;
        Clock_Wait(1000);
        if(OutputOobBlinkCount > OutputOobData+3)
        {
            OutputOobBlinkCount = 0;
        }
    }
}
#endif


