bscopix/Ble_Mesh_Kp/STM32_WPAN/App/appli_mesh.c
#ifdef GENERATE_STATIC_RANDOM_MAC
  /* 6bytes of MAC will be filled, baddr_tmp[7] will contain the length  */
  status = aci_hal_read_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, 
                                    &bdaddr[7], 
                                    bdaddr); 
  if(status != BLE_STATUS_SUCCESS) 
  {
    TRACE_I(TF_PROVISION, "Failed to read Random Address %d", status);
  }

  bdaddr[7] = GENERATE_STATIC_RANDOM_MAC;   
                      /* Do nothing for bdaddr, just pass the identification */
  result = 1;         /* This will overwrite the above for loop result, 
                          which is redundant for this case */
#endif  
  
  return result;
}


/**
* @brief  Reads the unique serial number of the device
* @param  void
* @retval void
*/
#ifdef INTERNAL_UNIQUE_NUMBER_MAC
static void Appli_GetMACfromUniqueNumber(void)
{
#ifdef STM32L152xE
  /************************STM32L152RE 96 bit Unique ID addresses***************/
#define DEVICE_ID_REG0 (0x1FF800D0)
#define DEVICE_ID_REG1 (0x1FF800D4)
#define DEVICE_ID_REG2 (0x1FF800E4)
#endif
  
  /*
  The unique serial number is a six bytes value generated from STM32 UID 
  stored at DEVICE_ID_REG0, DEVICE_ID_REG1 and DEVICE_ID_REG2. It is generated 
  cancating 4bytes from DEVICE_ID_REG2 and first bytes of DEVICE_ID_REG0 and 
  DEVICE_ID_REG1. Since the UID at DEVICE_ID_REG0 and 
  DEVICE_ID_REG1 could be identical for same batch samples, 
  4 bytes have been taken from DEVICE_ID_REG2
  */
  
  uint8_t i;
  uint8_t sum = 239;

  /* Utilise GetMacAdd() — même algo que le firmware GATT (BuildMacAdd = 0xC000<<32 + UDN).
   * Garantit que BD_MAC Mesh == BD_MAC GATT sur le même chip. */
  {
    uint64_t mac = GetMacAdd();
    bdaddr[0] = (uint8_t)(mac & 0xFFULL);
    bdaddr[1] = (uint8_t)((mac >>  8) & 0xFFULL);
    bdaddr[2] = (uint8_t)((mac >> 16) & 0xFFULL);
    bdaddr[3] = (uint8_t)((mac >> 24) & 0xFFULL);
    bdaddr[4] = (uint8_t)((mac >> 32) & 0xFFULL);
    bdaddr[5] = (uint8_t)((mac >> 40) & 0xFFULL);
  }
  /* Static Device Address: 
  The two most significant bits 
  of the address shall be equal to 1, 
  hence ORed with 0xC0)*/
  
  for (i = 0; i < 6; ++i)
  {
    sum = (sum << 1) + bdaddr[i];
  }
  bdaddr[6] = sum;
}
#endif


#if 0 
/**
* @brief  provides the information of the power saving mode
* @param  sleepMode currently unused, to be used in future 
* @retval SleepModes returns the mode of the controller
*/
SleepModes App_SleepMode_Check(SleepModes sleepMode)
{
  if (buttonState == BS_OFF)
  {
    return SLEEPMODE_WAKETIMER;
  }
  else
  {
    return SLEEPMODE_RUNNING;
  }
}
#endif

/**
* @brief  callback for unprovision the node by provisioner.
* @param  status reserved for future 
* @retval void
*/
void BLEMesh_UnprovisionCallback(MOBLEUINT8 reason)
{
  ProvisionFlag = 0; 
  
  BLEMesh_Process();
  HAL_Delay(100);
#if PB_ADV_SUPPORTED
  BLEMesh_SetUnprovisionedDevBeaconInterval(PBADV_UNPROV_DEV_BEACON_INTERVAL);
#endif
  BLEMesh_StopAdvScan();
  HAL_Delay(100);
    
  TRACE_I(TF_PROVISION,"Device is unprovisioned by application \r\n");      

  Appli_EraseProvisioningStorage();
  ClearProvisioningBootRequest(PROVISION_RESULT_UNKNOWN);
  TRACE_I(TF_PROVISION,"Reset Device\r\n");      

  HAL_Delay(100);

  NVIC_SystemReset();
}

/**
* @brief  This function scans and prints unprovisioned devices  
* @param  unprovDeviceArray: Pointer of an array for filling unprovisioned device UUIDs
* @param  noOfUnprovDevices: Pointer to take total count of nearby unprovisioned devices
* @retval MOBLE_RESULT
*/  
MOBLE_RESULT BLEMesh_ScanDevices(neighbor_params_t *unprovDeviceArray, MOBLEUINT8 *noOfUnprovDevices)
{
  MOBLE_RESULT result;
  
    result = BLEMesh_GetNeighborState(unprovDeviceArray,noOfUnprovDevices);
    /* Array print for testing */
    /* Check if any unprovisioned device is available */
    if(!(*noOfUnprovDevices))
    {
        TRACE_I(TF_PROVISION,"No Unprovisioned Device Nearby\r\n");  
    }
    else
    {
        for(MOBLEINT8 count=0; count < *noOfUnprovDevices; count++)
        {
          BLEMesh_PrintStringCb("");  
          TRACE_I(TF_PROVISION,"Device-%d -> ", count);  
          BLEMesh_PrintDataCb(unprovDeviceArray[count].uuid, 16);
        }
    }
  return result;
}
/**
* @brief  This function returns starts the provisioning of one of the devices
* @param  unprovDeviceArray: Pointer of an array having unprovisioned device UUIDs
* @param  index: Index of the device to be provisioned
* @retval MOBLE_RESULT
*/  
MOBLE_RESULT BLEMesh_ProvisionDevice(neighbor_params_t *unprovDeviceArray, MOBLEUINT16 index)
{
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
    
  result = BLEMesh_ProvisionRemote((unprovDeviceArray+index)->uuid);

  return result;
}

/* Customized implementation for provisioning a device from mesh node - End */

/**
* @brief  Call back function called when PB-ADV link Opened  
* @param  none
* @retval none
*/ 
void BLEMesh_PbAdvLinkOpenCb(void)
{ 
  ProvisionFlag = 0;
  TRACE_I(TF_PROVISION,"PB-ADV Link opened successfully \n\r");
  /* Turn ON Red LED*/
#if LOW_POWER_FEATURE
  /* do nothing */
#else
  BSP_LED_On(LED_RED);
#endif
}


/**
* @brief  Call back function called when PB-ADV link Closed   
* @param  none
* @retval none
*/ 
void BLEMesh_PbAdvLinkCloseCb(void)
{
  TRACE_I(TF_PROVISION,"PB-ADV Link Closed successfully \n\r");
  /* Turn Off Red LED*/
#if LOW_POWER_FEATURE
  /* do nothing */
#else
  BSP_LED_Off(LED_RED);
#endif
}


/**
* @brief  callback for provision the node by provisioner.
* @param  void
* @retval void
*/
void BLEMesh_ProvisionCallback(void)
{
  ProvisionFlag = 1;
  ConfigServerDirty = 0U;
  ProvisioningTimeoutNotified = 0U;
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  PrvngInProcess = 0;
#endif
  TRACE_I(TF_PROVISION,"Device is provisioned by provisioner \r\n");
  if (IsProvisioningRuntimeSessionActive() &&
      (ProvisioningSessionCommitPending == 0U))
  {
    ProvisioningSessionCommitPending = 1U;
    TRACE_I(TF_PROVISION,"Provisioning complete: waiting PB-GATT disconnect for NVM commit\r\n");
  }
  
