bscopix/Ble_Mesh_Kp/STM32_WPAN/App/appli_mesh.c
  HW_TS_Start(discoverTimer_Id, DISCOVER_TIMER_INTERVAL);
#endif
  
#if ENABLE_SERIAL_INTERFACE
  Serial_Init();
#endif
  
#ifdef SAVE_MODEL_STATE_POWER_FAILURE_DETECTION       
  GPIO_InitNVICPowerOff();
#endif 
  
#if 0
#if (( CFG_LPM_SUPPORTED == 0) && (ENABLE_PWM_SUPPORT == 1))
  __HAL_RCC_TIM1_CLK_ENABLE();
  __HAL_RCC_TIM2_CLK_ENABLE();
  PWM_Init();
#ifdef USER_BOARD_1LED
  Modify_PWM(SINGLE_LED, 1);     
#endif
#ifdef  USER_BOARD_COOL_WHITE_LED
  Modify_PWM(COOL_LED, 0); 
  Modify_PWM(WARM_LED, 0); 
#endif
#ifdef  USER_BOARD_RGB_LED
  Modify_PWM(RED_LED, 1); 
  Modify_PWM(GREEN_LED, 1); 
  Modify_PWM(BLUE_LED, 1);
#endif
#endif
#endif
  
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_SW1_REQ_ID, UTIL_SEQ_RFU, AppliMeshSW1Task );
  
#if (ENABLE_CUSTOM_BEACON == 1)
  BLEMesh_SetCustomBeaconInterval(CUSTOM_BEACON_INTERVAL);
#endif

#if (LOW_POWER_FEATURE == 1)  
  /**
  * Create Timer to control unprovisioned device beacons
  */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &lowPowerNodeApiTimer_Id, hw_ts_SingleShot, LowPowerNodeApiTask);
  
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_LPN_REQ_ID, UTIL_SEQ_RFU, LowPowerNodeApiApp );
  LPN_scan_enabled = MOBLE_FALSE;
#endif
#if (ENABLE_SENSOR_MODEL_SERVER != 0)
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_SW3_REQ_ID, UTIL_SEQ_RFU, AppliMeshSW3Task );
#endif
  
#ifdef ENABLE_AUTH_TYPE_INPUT_OOB
  /**
  * Create Timer to control Input OOB information
  */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &InputOOBTimeOut_Id, hw_ts_SingleShot, InputOOBTimeOutTask);
#endif

}

/*****************************Config Model Callbacks***************************/
/**
* @brief  Callback from Config Model to receive the Publication Parameters
* @param  Structure Pointer having parameters - modelID, elementAddress,
*         Publish Address, PublishPeriod, PublishTTL, Credential Flag, 
*         Publish AppKeyIndex, Retransmit Count & Restransmit Interval Steps
* @retval none
*/ 
void Appli_GetPublicationParamsCb(model_publicationparams_t* pPubParameters)
{
  if(pPubParameters->modelID == SENSOR_SERVER_MODEL_ID)
  {
    Sensor_ModelPublishSet(pPubParameters);
  }
}


/**
* @brief  PWM_CoolValue: This function is used to calculate the value for the 
          cool temperature for the light.
* @param  colourValue: Temperature value ratio
* @param  brightValue: Lightness value ratio.
* @retval duty: duty for the PWM
*/ 
MOBLEUINT16 PWM_CoolValue(float colourValue ,float brightValue)
{
  float colourDuty; 
  MOBLEUINT16 duty;
  
  colourDuty = colourValue * brightValue;    
  duty = (MOBLEUINT16)(colourDuty * PWM_TIME_PERIOD);
  
  return duty;
}


/**
* @brief  PWM_WarmValue: This function is used to calculate the value for the 
          warm temperature for the light.
* @param  colourValue: Temperature value ratio
* @param  brightValue: Lightness value ratio.
* @retval duty: duty for the PWM
*/ 
MOBLEUINT16 PWM_WarmValue(float colourValue ,float brightValue)
{
  float warmDuty;    
  MOBLEUINT16 duty;
  
  warmDuty = (1-colourValue)* brightValue;
  duty = (MOBLEUINT16)(warmDuty * PWM_TIME_PERIOD);
  
  return duty;
}

/**
* @brief  PwmValueMapping: This function takes the value as parameter from the 
*         model and return the value according to .
* @param  setValue: value to be set from model
* @param  maxRange: Max range of the parameter
* @param  minRange: Min range of the parameter
* @retval MOBLEUINT8
*/
MOBLEUINT16 PwmValueMapping(MOBLEUINT16 setValue , MOBLEUINT16 maxRange , MOBLEINT16 minRange)
{
  MOBLEUINT16 percentValue;
  MOBLEUINT16 duty;
  
#ifdef SMART_PLUG
   percentValue =  (setValue * 100)/ (maxRange - minRange);
        
   if(percentValue < 2)
   {
     duty = 0;
   }   
   else if((percentValue > 2) && (percentValue <= 10))
   {
     duty = 1;
   }
   else if((percentValue > 10) && (percentValue <= 20))
   {
     duty = 2;
   }
   else if((percentValue > 20) && (percentValue <= 30))
   {
     duty = 3;
   }
   else if((percentValue > 30) && (percentValue <= 40))
   {
     duty = 4;
   }
   else if((percentValue > 40) && (percentValue <= 50))
   {
     duty = 5;
   }
   else if((percentValue > 50) && (percentValue <= 60))
   {
     duty = 6;
   }
   else if((percentValue > 60) && (percentValue <= 70))
   {
     duty = 7;
   }
   else if((percentValue > 70) && (percentValue <= 80))
   {
     duty = 8;
   }
   else if((percentValue > 80) && (percentValue <= 90))
   {
     duty = 9;
   }
   else if(percentValue > 90)
   {
     duty = 10;
   }
#else
   if(minRange > 0x00)
   {
     percentValue =  (setValue - 800)/ (maxRange - minRange);
     percentValue = (percentValue*100);
   }
   else
   {
     percentValue =  (setValue * 100)/ (maxRange - minRange);
   }
   
   duty = percentValue*320 ;
   
   if(duty >= 32000)
   {
     duty = 31999;
   }
   if(duty == 0)
   {
     duty = 1;
   }
#endif
     
   return duty;
}


/************************************ Weak linking ***********************************
If implemented in application, linker would replace weak linking in library */
WEAK_FUNCTION (void SerialPrvn_ProvisioningStatusUpdateCb(uint8_t flagPrvningInProcess, MOBLEUINT16 nodeAddress))
{
  (void)flagPrvningInProcess;
  (void)nodeAddress;
}


/**
* @}
*/

/**
* @}
*/
